{"/about/":{"data":{"":"Hey, I’m typewatch. I’m a student with an innate desire for knowledge. I’ve dabbled in various engineering fields along the years, and I built this website to store everything I have done so far.","contact-info#Contact Info":"Github - typewatch Discord - typewatch Email - typewatch(at)proton(dot)me","resume#Resume":"myresume.pdf","website#Website":"This website was built with Hugo, is based on a custom theme named Hextra, and is hosted by GitHub.\nTo learn how to make your own website, check out these resources:\nGithub Pages Hugo Quickstart Hugo Themes Library"},"title":"About"},"/blog/helloworld/":{"data":{"":"Hey! I’m typewatch, a guy on the internet that likes to learn about interesting stuff. Coincidentally, I also make interesting stuff.\nWelcome to my little corner of the internet! I made this website as a companion for my bigger projects; this’ll be where I store and organize writeups, details, resources, docs, guides, and whatnot. I might post a blog entry or two every now and then, too.\nMore to come soon, I think."},"title":"Hello World!"},"/docs/":{"data":{"":"Welcome to my docs archive; here you can find in-depth information regarding almost all of my projects.","archived#Archived":"HelloDrum-2","feedback#Feedback":"I heavily appreciate feedback; please visit the about page for more information.","in-development#In Development":"Driver40 Totum"},"title":"Documentation"},"/docs/driver40/":{"data":{"":"GitHub\rYouTube\rDriver40 is an ultraportable, 4x5 ortholinear, low profile split keyboard. Handful of words huh? Here’s what they mean:\n4x5: The keyboard is built with a 4-row, 5-column key configuration. ortholinear: This means that the keys in the keyboard are not staggered, and instead aligned in a square grid. low profile: As you might’ve guessed, this means that the keyboard’s height is low, or in other words, it is a particularly slim keyboard. split: In contrast to a typical keyboard, which is one long rectangular slab with keys, a split keyboard is two slabs, interconnected with wires or through wireless signals.","the-process#The Process":"Building a fully custom keyboard is surprisingly easy nowadays; with just a little bit of tech-wiz and a weekend or two, you can make your very own keyboard.","the-result#The Result":"Not done yet lol.","why#Why?":"I built a lily58 not very long ago, and I love it. It’s a 58-key, 4x6 column staggered split keyboard.\nIt’s really comfortable to type on for long periods of time, and I found the way it uses layers to “hide” keys that are barely used but still necessary to keep at hand much more practical than having a big keyboard with keys for all kinds of functions.\nAs a student, I spend most of my time away from my desk: sometimes I’m on campus, other times I’m at a coffee shop, maybe I’m at a friend’s, or at the library—and unfortunately, the homework doesn’t stop flowing. Thanks to this I pretty much always carry my school backpack with me to work on the go—freeing time for other stuff, like my hobbies.\nWith time, I’ve refined my perfect layout on the lily. I have come to the realization that—something that I saw as shocking and painful to use—whoever was the first to pave the way into \u003c40% keyboards had a genius idea. With layers, less keys is possible and actually better (YMMV) than more keys. You can stash everything you’d ever need into a couple of layers you can access with a combo of thumb cluster keys and have all of your regular functions, cherry-picked for efficiency, literally at your fingertips.\nMiss the F-row? Press thumbkey1 and get it back alongside a numrow and symbols or whatever.\nWant a numpad? Done, it’s in layer 3 on your right half of the keyboard. Hold thumbkey1 + thumbkey2 to access it.\nGiven this, I was able to go for a radical 40-key layout without sacrificing anything but whatever time it’d take to learn that keyboard’s layout.\nEnter Driver40, a remix of the conductor keyboard by Horiguchi Hidetaka. When I stumbled upon conductor, I really liked its design and the bells and whistles attatched to it, but I thought I could go further with its concept, and fine-tune it to my needs."},"title":"Driver40"},"/docs/driver40/bom/":{"data":{"":"bill of material for keyboard thing"},"title":"Bill of Materials"},"/docs/driver40/buildguide/":{"data":{"":"driver40 keyboard\nstuff"},"title":"Build Guide"},"/docs/hellodrum-2/":{"data":{"":"GitHub\rYouTube\rHelloDrum-2 is an unofficial remix and continuation of the original HelloDrum DIY e-drums project by Ryo Kosaka.\nHelloDrum is a simple, open source, easy-to-build modular e-drum kit made to be as cheap and easy to build as possible that utilizes the MIDI protocol, making it compatible with virtually every music-making hardware or software out there. You can mix-n-match modules to create your own kit, or pick your favorite ones to expand your current e-kit!"},"title":"HelloDrum-2"},"/docs/license/":{"data":{"":"","contact#Contact":"Visit the about page for more information.","projects--content#Projects \u0026amp; Content":"All content featured in this website—including my projects, unless listed as otherwise within their according github repositories—is licensed under the CC-BY-NC-SA License.","site-code#Site Code":"All code for the site is licensed under the MIT License."},"title":"License"},"/docs/roomos/":{"data":{"":"GitHub\rYouTube\rroomOS thing\nstuff"},"title":"RoomOS"},"/docs/totum/":{"data":{"":"GitHub\rYouTube\rtotum (super secret project)"},"title":"Totum"},"/docs/zenith/":{"data":{"":"GitHub\rYouTube\ruhh imagine the stuff below is placeholder text and not real zenith writeup stuff\nZenith is a product development exercise and jab at the premade/semi-DIY air purifier market. The aforementioned market is full of great products that do their job remarkably well—however—multiple of them unfortunately boast intentional kinks and pointless features that turn an excellent device into an underperforming, expensive, unrepairable paperweight. This air purifier aims to perform one thing and one thing only: air purification. No more, no less. By avoiding scope creep and pointless overengineering, Zenith ends up as a relatively cheap, stylish, and efficient air purifier.\nSeveral versions have been released, all based on the same core device, with varying levels of bells and whistles that add a little bit extra to the user experience. All parts \u0026 upgrades are modular and can be added, removed and replaced with nothing more than a screwdriver, and a little bit of time.\nSo I’ve been researching air quality and purification for a little while by now and, among the many interesting bits of info I’ve picked up along the way, I have also found that “real” (consumer-oriented brand-made) air purifiers are really expensive, laughably inefficient (see “filters” section for explanation) and blatant exemplars of the razor and blades business model. Just straight up awful.\nTo combat this and price-hikes during covid, corsi-rosenthal boxes popped up. CRboxes are great little cost-effective doohickeys that have helped many people stay safe and breathe clean air for years, although they introduce some uncertainty to the ease-of-use brand air purifiers provide, and require some DIYing, which may put away some people from getting an air purifier. Noticing this issue, prebuilt crboxes came to existance. I have a grudge with most prebuilt crbox manufacturers because not only are these air purifiers incredibly expensive (at or above the pricepoint of brand air purifiers), they also look really bad and have a lot of really unnecessary bloat that just bumps the price up even higher.\nZenith aims to perform one thing and one thing only: air purification. No more, no less. By avoiding scope creep and pointless overengineering, I reckon a decently-performing, decently-looking premade crbox can be achieved.\nI will begin development shortly, but I’m afraid a prototype might take a little time before happening due to budget constraints. I’ll link up zenith’s github soon™","filters#Filters":"I forgot to explain the inefficient part, and kind of ran out of space to do it properly, so here’s a half-assed version: Air purifiers are really simple machines; they slurp up air, sift it through a filter and push it out. The more air volume your purifier filters in a given time, the better it is at purifying air. Most brand purifiers tend to use filters labeled as HEPA filters, which are rated to clean up to 99.97% of 0.3µm particles. That sounds good…right? Well, yes—and no. As I mentioned earlier, a good air purifier is one that can clean a big volume of air quickly, meaning it will most often than not go through the same air multiple times. A HEPA filter will clean practically everything with the first pass, but will also heavily restrict airflow, making your air purifier worse compared to one using a run-of-the-mill MERV 13 filter rated for 50% of 0.3µm particles, which will go through x volume of air multiple more times and clean what it didn’t get on the first pass fairly quickly."},"title":"Zenith"},"/docs/zenith/bom/":{"data":{"":"bill of materials for zenith"},"title":"Bill of Materials"},"/docs/zenith/buildguide/":{"data":{"":"build guide for zenith"},"title":"Build Guide"},"/projects/":{"data":{"":"These are some of the things I've worked on Driver40 Totum HelloDrum-2 Zenith"},"title":"Projects"}}