{"/about/":{"data":{"":"Hey, I’m typewatch. I’m a student with an innate desire for knowledge. I’ve dabbled in various engineering fields along the years, and I built this website to store everything I have done so far.","contact-info#Contact Info":"Github - typewatch Discord - typewatch Email - typewatch(at)proton(dot)me","resume#Resume":"myresume.pdf","website#Website":"This website was built with Hugo, is based on a custom theme named Hextra, and is hosted by GitHub.\nTo learn how to make your own website, check out these resources:\nGithub Pages Hugo Quickstart Hugo Themes Library"},"title":"About"},"/blog/helloworld/":{"data":{"":"Hey! I’m typewatch, a guy on the internet that likes to learn about interesting stuff. Coincidentally, I also make interesting stuff.\nWelcome to my little corner of the internet! I made this website as a companion for my bigger projects; this’ll be where I store and organize writeups, details, resources, docs, guides, and whatnot. I might post a blog entry or two every now and then, too.\nMore to come soon, I think."},"title":"Hello World!"},"/docs/":{"data":{"":"Welcome to my docs archive; here you can find in-depth information regarding almost all of my projects.","archived#Archived":"your mom","feedback#Feedback":"I heavily appreciate feedback; please visit the about page for more information.","in-development#In Development":"driver40"},"title":"Documentation"},"/docs/driver40/":{"data":{"":"Driver40 is an ultraportable, 4x5 ortholinear, low profile split keyboard. Handful of words huh? Here’s what they mean:\n4x5: The keyboard is built with a 4-row, 5-column key configuration. ortholinear: The keys in the keyboard are low profile: split:","why#Why?":"I like split keyboards, and needed a portable keyboard to carry with me on a day-to-day basis. I have an MX lily58 at home, and I really like it, but sometimes when I’m away from my desk and I need to sit down and churn out some code, do homework, or just play a game, I miss the perfection that is\nI looked around for a little while, and found nothing that caught my eye, so I decided to make my own. After all, I have previously done similar things, and I figured it’d be worth it since I would be able to fine-tune it to my liking.\nI set forth a few things I wanted out of a keyboard, and got sketching. You can see the whole process in the more in-depth write-up found at driver40/devlog/, or at my website.\nDriver40 is what I ended up with. I also implemented a few other nifty features and turned them into their own variations of the primary build, which you can see above."},"title":"Driver40"},"/docs/driver40/bom/":{"data":{"":"bill of material for keyboard thing"},"title":"Bill of Materials"},"/docs/driver40/buildguide/":{"data":{"":"driver40 keyboard\nstuff"},"title":"Build Guide"},"/docs/hellodrum-2/":{"data":{"":"hellodrum-2 page\nstuff"},"title":"HelloDrum-2"},"/docs/license/":{"data":{"":"","contact#Contact":"Visit the about page for more information.","projects--content#Projects \u0026amp; Content":"All content featured in this website—including my projects, unless listed as otherwise within their according github repositories—is licensed under the CC-BY-NC-SA License.","site-code#Site Code":"All code for the site is licensed under the MIT License."},"title":"License"},"/docs/roomos/":{"data":{"":"RoomOS assistant\nstuff"},"title":"RoomOS"},"/docs/totum/":{"data":{"":"totum 3d printer\nstuff"},"title":"Totum"},"/docs/zenith/":{"data":{"":"zenith air purifier\nstuff"},"title":"Zenith"},"/projects/":{"data":{"":"These are some of the things I've worked on Driver40 Totum HelloDrum-2 Zenith"},"title":"Projects"}}